#+title:      B Klasse 2021-25
#+date:       [2024-09-08 So 21:42]
#+filetags:   :4b:
#+identifier: 20240908T214223

* Jahresplanung
[[denote:20240719T131544][Jahresplanung 04]]

* Stundenplanung

** Einführung
Persönliche Vorstellung;

Bücher aus "Warteklasse" holen

Gemeinsames Lied singen
Gebet? Psalm? YouCat Daily?

** Wiederholung
Was habt ihr im RU bisher gemacht?
Wie war er?
Hefteintrag?
etc...

** Themen
[[denote:20240909T205227][Was ist gut und richtig?]]

[[denote:20240909T205419][Ein gutes Gewissen]]

** Hefteintrag
Arbeitsweg 1 - 5

http://www.veritas.at/code (rfu426) für Material und Übungen

Übungsteil S. 26

* Klassenliste
#+Name: 2021-students
| First     | Last       | Name               | Note | Mitarbeit | Heft | LZK |
|-----------+------------+--------------------+------+-----------+------+-----|
| Tobias    | Bernhofer  | [[Tobias Bernhofer][Tobias Bernhofer]]   |    1 |           |      |     |
| Alexander | Cerny      | [[Alexander Cerny][Alexander Cerny]]    |    1 |           |      |     |
| Laurin    | Ellmer     | [[Laurin Ellmer][Laurin Ellmer]]      |    1 |           |      |     |
| Amrit     | Gappmaier  | [[Amrit Gappmaier][Amrit Gappmaier]]    |    1 |           |      |     |
| Olivia    | Gappmaier  | [[Olivia Gappmaier][Olivia Gappmaier]]   |    1 |           |      |     |
| Nadine    | Gschiel    | [[Nadine Gschiel][Nadine Gschiel]]     |    1 |           |      |     |
| Damien    | Hettegger  | [[Damien Hettegger][Damien Hettegger]]   |    1 |           |      |     |
| Christian | Kronreif   | [[Christian Kronreif][Christian Kronreif]] |    1 |           |      |     |
| Rafael    | Lainer     | [[Rafael Lainer][Rafael Lainer]]      |    1 |           |      |     |
| Leopold   | Lechner    | [[Leopold Lechner][Leopold Lechner]]    |    1 |           |      |     |
| Hannah    | Lutje      | [[Hannah Lutje][Hannah Lutje]]       |    1 |           |      |     |
| Leonhard  | Malter     | [[Leonhard Malter][Leonhard Malter]]    |    1 |           |      |     |
| Sunmaya   | Marek      | [[Sunmaya Marek][Sunmaya Marek]]      |    1 |           |      |     |
| Khushboo  | Markandey  | [[Khushboo Markandey][Khushboo Markandey]] |    1 |           |      |     |
| Moritz    | Neuhofer   | [[Moritz Neuhofer][Moritz Neuhofer]]    |    1 |           |      |     |
| Heidi     | Pichler    | [[Heidi Pichler][Heidi Pichler]]      |    1 |           |      |     |
| Jakob     | Salchegger | [[Jakob Salchegger][Jakob Salchegger]]   |    1 |           |      |     |
| Elias     | Schieferer | [[Elias Schieferer][Elias Schieferer]]   |    1 |           |      |     |
| Nikolaj   | Schwaiger  | [[Nikolaj Schwaiger][Nikolaj Schwaiger]]  |    1 |           |      |     |
| Florian   | Siller     | [[Florian Siller][Florian Siller]]     |    1 |           |      |     |
| Michael   | Steiner    | [[Michael Steiner][Michael Steiner]]    |    1 |           |      |     |
| Pascal    | Stippler   | [[Pascal Stippler][Pascal Stippler]]    |    1 |           |      |     |
| Alexander | Wenger     | [[Alexander Wenger][Alexander Wenger]]   |    1 |           |      |     |
| Oskar     | Wieser     | [[Oskar Wieser][Oskar Wieser]]       |    1 |           |      |     |
| Veit      | Zierfuß    | [[Veit Zierfuß][Veit Zierfuß]]       |    1 |           |      |     |
|-----------+------------+--------------------+------+-----------+------+-----|
#+TBLFM: $4=vmean($5..$>);%.0f
#+TBLFM: $3='(concat "[[" $1 " " $2 "][" $1 " " $2 "]]")
#+TBLFM: $5='(identity remote(Mitarbeit,@@#$2))

#+BIND: org-export-filter-timestamp-functions (tmp-f-timestamp)
#+BIND: org-export-filter-strike-through-functions (tmp-f-strike-through)
#+BEGIN_SRC emacs-lisp :exports results :results none
  (defun tmp-f-timestamp (s backend info)
    (replace-regexp-in-string "&[lg]t;\\|[][]" "" s))
  (defun tmp-f-strike-through (s backend info) "")
#+END_SRC


#+BEGIN_SRC python :var table=2021-students :results output raw
  print('* Mitarbeit')
  for student in table:
      first = student[0]
      last = student[1]
      email = first + '.' + last + '@abtenau.schule'
      print('** ' + first + ' ' + last + '')
      print(':PROPERTIES:')
      print(':EMAIL: ' '[[mailto: ' + first + ' ' + last + ' <' + email + '>]]')
      print(':EXPORT_FILE_NAME: ' '~/RoamNotes/exports/'  + first +  '_'  + last +  '.html')
      print(':ID: ' + first + '' + last + '')
      print(':END: ')
      print('#+Name: Note_' + first + '' + last + '')
      print('|-----------------------+-------+-------------+-----+-----------+------------|')
      print('| Datum                 | Topic | Heft / Buch | LZK | Mitarbeit | Gesamtnote |')
      print('|-----------------------+-------+-------------+-----+-----------+------------|')
      print('|                       |       |             |     |           |            |')
      print('#+TBLFM: $6=vmean($3..$5);%.0f')
      print('\n')
#+END_SRC

#+RESULTS:


